tap "aquasecurity/trivy"
tap "derailed/k9s"
tap "jesseduffield/lazydocker"
tap "mongodb/brew"
# Strip or convert ANSI codes into HTML, (La)Tex, RTF, or BBCode
brew "ansifilter"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Automatic configure script builder
brew "autoconf"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Library for command-line editing
brew "readline"
# Python code formatter
brew "black"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Anti-virus software
brew "clamav"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# YAML Parser
brew "libyaml"
# Defines a standard way of committing rules and communicating it
brew "commitizen"
# GNU multiple precision arithmetic library
brew "gmp"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Create thumbnails for your video files
brew "ffmpegthumbnailer"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go formatter that additionally inserts import statements
brew "goimports"
# Google Testing and Mocking Framework
brew "googletest"
# Ping, but with a graph
brew "gping"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Fast, Dynamic Programming Language
brew "julia"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Simple terminal UI for git commands
brew "lazygit"
# Manipulate OpenType and multiple-master fonts
brew "lcdf-typetools"
# Pager program similar to more
brew "less"
# Additional guest agents for Lima
brew "lima-additional-guestagents"
# Rainbows and unicorns in your console!
brew "lolcat"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Scalable distributed version control system
brew "mercurial"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# CLI for MySQL with auto-completion and syntax highlighting
brew "mycli"
# Open source relational database management system
brew "mysql", restart_service: :changed
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Oracle Cloud Infrastructure CLI
brew "oci-cli"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Python package management tool
brew "poetry"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# SVG rendering tool and library
brew "resvg"
# 7-Zip is a file archiver with a high compression ratio
brew "sevenzip"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Programmatically correct mistyped console commands
brew "thefuck"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Modern watch command
brew "viddy"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Scanner for vulnerabilities in container images, file systems, and Git repositories, as well as for configuration issues
brew "aquasecurity/trivy/trivy"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "derailed/k9s/k9s"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Developer platform
cask "dotnet-sdk"
cask "font-meslo-lg-nerd-font"
cask "font-noto-color-emoji"
cask "font-noto-sans-mono-cjk-sc"
cask "font-symbols-only-nerd-font"
# Oracle SQLcl is the modern command-line interface for the Oracle Database
cask "sqlcl"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
mas "iMovie", id: 408981434
mas "Xcode", id: 497799835
